In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [4]:
np.random.seed(101) ### it will generate pseudo random numer. if you seed same number. always random generator value return the  same  value with same input

In [6]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [8]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [9]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [10]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [14]:
type(df['W'])

pandas.core.series.Series

In [15]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df['W'].dtype

dtype('float64')

In [20]:
## Fetch multiple columns
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [21]:
## Add new columns to dataframe
df['new']=df['Z'] + 100

In [22]:
df

          W         X         Y         Z         new
A  0.302665  1.693723 -1.706086 -1.159119   98.840881
B -0.134841  0.390528  0.166905  0.184502  100.184502
C  0.807706  0.072960  0.638787  0.329646  100.329646
D -0.497104 -0.754070 -0.943406  0.484752  100.484752
E -0.116773  1.901755  0.238127  1.996652  101.996652

In [23]:
## Drop the column new
df.drop('new',axis=1) ## Axis=0 means row and Axis=1 columns.it means delete column new from axis=1(column)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [24]:
df

          W         X         Y         Z         new
A  0.302665  1.693723 -1.706086 -1.159119   98.840881
B -0.134841  0.390528  0.166905  0.184502  100.184502
C  0.807706  0.072960  0.638787  0.329646  100.329646
D -0.497104 -0.754070 -0.943406  0.484752  100.484752
E -0.116773  1.901755  0.238127  1.996652  101.996652

In [25]:
##to delete actually coumns from dataframe then have use inplace
df.drop('new',axis = 1,inplace=True)

In [26]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [27]:
## Drop rows 
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [28]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [29]:
## Selecting rows A by loc
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [32]:
df.iloc[0] ## Selecting rows by index 0 nothing but rows A

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [33]:
## Selecting row B and column Y value
df.loc['B','Y']

0.16690463609281317

In [34]:
## Get multiple rows and columns
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [35]:
df.shape

(5, 4)